# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 3
depth_multiple: 1.0
width_multiple: 1.0

# ResNet18 backbone
backbone:
  - [-1, 1, ResNet18Stage, [0]]   # 0 - stem, 64ch, stride 4
  - [-1, 1, ResNet18Stage, [1]]   # 1 - layer1, 64ch, stride 4
  - [-1, 1, ResNet18Stage, [2]]   # 2 - layer2, 128ch, stride 8  ← P3
  - [-1, 1, ResNet18Stage, [3]]   # 3 - layer3, 256ch, stride 16 ← P4
  - [-1, 1, ResNet18Stage, [4]]   # 4 - layer4, 512ch, stride 32 ← P5
  - [-1, 1, SPPF, [512, 5]]       # 5 - 512ch
  - [-1, 2, C2PSA, [512]]         # 6 - 512ch

# Detection head — channels must match backbone exactly
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 7  - 512ch, stride 16
  - [[-1, 3], 1, Concat, [1]]                    # 8  - concat P4: 512+256 = 768ch
  - [-1, 2, C3k2, [256, False]]                  # 9  - 256ch

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10 - 256ch, stride 8
  - [[-1, 2], 1, Concat, [1]]                    # 11 - concat P3: 256+128 = 384ch
  - [-1, 2, C3k2, [128, False]]                  # 12 - 128ch (P3/8-small)

  - [-1, 1, Conv, [128, 3, 2]]                   # 13 - 128ch, stride 16
  - [[-1, 9], 1, Concat, [1]]                    # 14 - concat: 128+256 = 384ch
  - [-1, 2, C3k2, [256, False]]                  # 15 - 256ch (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]                   # 16 - 256ch, stride 32
  - [[-1, 6], 1, Concat, [1]]                    # 17 - concat: 256+512 = 768ch
  - [-1, 2, C3k2, [512, True]]                   # 18 - 512ch (P5/32-large)

  - [[12, 15, 18], 1, Detect, [nc]]              # Detect(P3, P4, P5)
