# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
# YOLO11 + CBAM (built-in Ultralytics conv.CBAM)

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]            # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]           # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]    # 2
  - [-1, 1, CBAM, [7]]              # 3  ← CBAM @256
  - [-1, 1, Conv, [256, 3, 2]]           # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]    # 5
  - [-1, 1, CBAM, [7]]              # 6  ← CBAM @512
  - [-1, 1, Conv, [512, 3, 2]]           # 7-P4/16
  - [-1, 2, C3k2, [512, True]]           # 8
  - [-1, 1, Conv, [1024, 3, 2]]          # 9-P5/32
  - [-1, 2, C3k2, [1024, True]]          # 10
  - [-1, 1, SPPF, [1024, 5]]             # 11
  - [-1, 2, C2PSA, [1024]]               # 12
  - [-1, 1, CBAM, [7]]             # 13 ← CBAM @1024 (top backbone/neck)

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 14
  - [[-1, 8], 1, Concat, [1]]                      # 15  cat backbone P4
  - [-1, 2, C3k2, [512, False]]                    # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 17
  - [[-1, 5], 1, Concat, [1]]                      # 18  cat backbone P3
  - [-1, 2, C3k2, [256, False]]                    # 19 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                     # 20
  - [[-1, 16], 1, Concat, [1]]                     # 21  cat head P4
  - [-1, 2, C3k2, [512, False]]                    # 22 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                     # 23
  - [[-1, 12], 1, Concat, [1]]                     # 24  cat head P5
  - [-1, 2, C3k2, [1024, True]]                    # 25 (P5/32-large)
  - [-1, 1, CBAM, [7]]                       # 26 ← CBAM @ P5 branch

  - [[19, 22, 26], 1, Detect, [nc]]                # 27  Detect(P3,P4,P5-after-CBAM)
