# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 3 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # idx,  out_stride
  - [-1, 1, Conv,  [64, 3, 2]]            # 0   P1/2
  - [-1, 1, Conv,  [128, 3, 2]]           # 1   P2/4
  - [-1, 2, C3k2,  [256, False, 0.25]]    # 2   P2/4
  - [-1, 1, Conv,  [256, 3, 2]]           # 3   P3/8
  - [-1, 2, C3k2,  [512, False, 0.25]]    # 4   P3/8
  - [-1, 1, Conv,  [512, 3, 2]]           # 5   P4/16
  - [-1, 2, C3k2,  [512, True]]           # 6   P4/16
  - [-1, 1, Conv,  [1024, 3, 2]]          # 7   P5/32
  - [-1, 2, C3k2,  [1024, True]]          # 8   P5/32
  - [-1, 1, SPPF,  [1024, 5]]             # 9   P5/32
  - [-1, 2, C2PSA, [1024]]                # 10  P5/32
  - [-1, 1, ECA,   [1024, 2, 1, null]]    # 11  P5/32  <-- single deep ECA

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12  up P5->P4
  - [[-1, 6], 1, Concat, [1]]                   # 13  cat with backbone P4 (idx 6)
  - [-1, 2, C3k2, [512, False]]                 # 14  P4 head

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15  up P4->P3
  - [[-1, 4], 1, Concat, [1]]                   # 16  cat with backbone P3 (idx 4)
  - [-1, 2, C3k2, [256, False]]                 # 17  P3 head (small)

  - [-1, 1, Conv, [256, 3, 2]]                  # 18  down P3->P4
  - [[-1, 14], 1, Concat, [1]]                  # 19  cat with head P4 (idx 14)
  - [-1, 2, C3k2, [512, False]]                 # 20  P4 head (medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 21  down P4->P5
  - [[-1, 11], 1, Concat, [1]]                  # 22  cat with backbone P5 (idx 11)
  - [-1, 2, C3k2, [1024, True]]                 # 23  P5 head (large)

  - [[17, 20, 23], 1, Detect, [nc]]             # 24  Detect [P3, P4, P5]
